RuanJG/stm32App/source/app/app_CSWL_Control_Board.c
int Ameter_start( int cnt )
{
	Ameter_en_cnt = cnt;
	
	if( Ameter_en_cnt == 0 ){
		miniMeter_stop(&Ameter);
		return 1;
	}else{
		if( 1 == miniMeter_start(&Ameter) ){
			Ameter_val_count = 0;
			Ameter_val = 0;
			return 1;
		}else{
			Ameter_en_cnt = 0;
			return 0;
		}
	}
}

void Ameter_even()
{
	float value;
	unsigned char data[4];
	
	if( Ameter_en_cnt == 0 ) return;
	
	if( 1== miniMeter_check( &Ameter, &value) ){
		Ameter_val_count++;
		Ameter_val += value;
		if( Ameter_val_count >= Ameter_en_cnt ){
			Ameter_val /= Ameter_val_count;
			memcpy( data, (unsigned char*) &Ameter_val , 4 );
			if( 0 == PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_AMETER, data , sizeof(data) ) ){
				PC_LOGE("Ameter_even: send data to PC error");
			}
			Ameter_val_count = 0;
			Ameter_val = 0;
		}
	}
}


/*
volatile int Vmeter_en_cnt;
volatile float Vmeter_val;
volatile int  Vmeter_val_count;

void Vmeter_init()
{
	miniMeter_init( &Vmeter ,VMETER_UART , 0x00);
	Vmeter_en_cnt = 0;
	Vmeter_val_count = 0;
}

int Vmeter_start( int cnt )
{
	Vmeter_en_cnt = cnt;
	
	if( Vmeter_en_cnt == 0 ){
		miniMeter_stop(&Vmeter);
		return 1;
	}else{
		if( 1 == miniMeter_start(&Vmeter) ){
			Vmeter_val_count = 0;
			Vmeter_val = 0;
			return 1;
		}else{
			Vmeter_en_cnt = 0;
			return 0;
		}
	}
}

void Vmeter_even()
{
	float value;
	unsigned char data[4];
	
	if( Vmeter_en_cnt == 0 ) return;
	
	if( 1== miniMeter_check( &Vmeter, &value) ){
		Vmeter_val_count++;
		Vmeter_val += value;
		if( Vmeter_val_count >= Vmeter_en_cnt ){
			Vmeter_val /= Vmeter_val_count;
			memcpy( data, (unsigned char*) &Vmeter_val , 4 );
			if( 0 == PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_VMETER, data , sizeof(data) ) ){
				PC_LOGE("Vmeter_even: send data to PC error");
			}
			Vmeter_val_count = 0;
			Vmeter_val = 0;
		}
	}
}
*/



#if USING_VICTOR8165_AS_VMETER


#define VICTOR8165_BUFFSIZE 31

Uart_t *victor8165_uart;
volatile int victor8165_step;
volatile int victor8165_received_result;
volatile int victor8165_buffer_index;
volatile int victor8165_updated;
volatile float victor8165_value;
volatile int victor8165_en;
char victor8165_buffer[VICTOR8165_BUFFSIZE+1];
systick_time_t victor8165_timer;



void victor8165_send_cmd( char* cmd)
{
	Uart_Put( victor8165_uart, (unsigned char *)cmd,  strlen(cmd) );
}

int victor8165_check( float *value)
{
	if( victor8165_updated == 1 ){
		*value = victor8165_value;
		victor8165_updated = 0;
		return 1;
	}
	return 0;
}

void victor8165_start()
{
	victor8165_step = 0;
	victor8165_buffer_index = 0;
	victor8165_received_result = 0;
	victor8165_updated= 0;
	victor8165_en =1;
}

void victor8165_stop()
{
	victor8165_updated= 0;
	victor8165_en =0;
}

void victor8165_init( Uart_t *uart )
{
	victor8165_uart = uart;
	victor8165_step = 0;
	victor8165_buffer_index = 0;
	victor8165_received_result = 0;
	victor8165_updated= 0;
	victor8165_en = 0;
}

void victor8165_even()
{
	int i,len;
	unsigned char data[4];
	
	for( i=0; i< VICTOR8165_BUFFSIZE; i++ ){
		if( 1== Uart_Get( victor8165_uart, (victor8165_buffer + victor8165_buffer_index) , 1) ){
			if( victor8165_buffer[victor8165_buffer_index] == 0x0A ){
				victor8165_received_result = victor8165_buffer_index+1;
				victor8165_buffer[victor8165_received_result] = 0; // set string end tag
				victor8165_buffer_index = 0;
				break;
			}else{
				victor8165_buffer_index ++;
				if( victor8165_buffer_index >= VICTOR8165_BUFFSIZE ) victor8165_buffer_index = 0;
			}
		}else{
			break;
		}
	}
	
	if( victor8165_en == 0 ) return; 
	
	switch (victor8165_step)
	{
		case 0: victor8165_send_cmd("VDC\n"); victor8165_step++; systick_init_timer(&victor8165_timer, 400); break;
		case 1: if(systick_check_timer(&victor8165_timer)){victor8165_send_cmd("RATE M\n");victor8165_step++;}break;
		case 2: if(systick_check_timer(&victor8165_timer)){victor8165_send_cmd("RANGE 3\n");victor8165_step++;}break;
		case 3: if(systick_check_timer(&victor8165_timer)){victor8165_send_cmd("FUNC1?\n");victor8165_step++;systick_init_timer(&victor8165_timer, 400);}break;
		case 4: 
				if( victor8165_received_result > 0 )
				{
						if( victor8165_received_result == strlen("VDC\n") && 0 == strncmp("VDC\n",(char*)victor8165_buffer , victor8165_received_result) ){
							victor8165_step++; 
						}else{
							victor8165_step = 0;
							PC_LOGE("victor8165_even: Init Error");
						}
						victor8165_received_result=0;
				}else{ 
				     if(systick_check_timer(&victor8165_timer)){
							 victor8165_step = 0;
							 PC_LOGE("victor8165_even: Init timeout");
						 }  
				}; 
	  break;	
		case 5: systick_init_timer(&victor8165_timer, 300);victor8165_send_cmd("MEAS1?\n");victor8165_step++;break;
		case 6:
			if( victor8165_received_result > 2 && 1 == sscanf((const char*)victor8165_buffer , "%e;\n",  &victor8165_value) ){
				//sscanf((const char*)victor8165_buffer , "%e;\n",  &victor8165_value);
				victor8165_updated = 1;
				memcpy( data, (unsigned char*) &victor8165_value , 4 );
				if( 0 == PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_VMETER, data , sizeof(data) ) ){
					PC_LOGE("victor8165_even: send data to PC error");
				}
				victor8165_received_result = 0;
				//no delay
				//victor8165_send_cmd("MEAS1?\n");
			}
			if(systick_check_timer(&victor8165_timer)){
				if( victor8165_updated == 0) {
					PC_LOGE("victor8165_even: MEAS1 cmd timeout");
					victor8165_start();
				}else{
					victor8165_send_cmd("MEAS1?\n");
					victor8165_buffer_index = 0;
					victor8165_received_result = 0;
					victor8165_updated= 0;
				}
			}
		break;
			
		default:
			PC_LOGE("victor8165_even: Something error!");
		break;
		
	}
}


#endif




#if USING_TONGHUI_TH963_VMETER

// cmd 'MEAS:VOLT:DC? 100\n' -> '2.45693330E-04\r\n'  or  '-2.45693330E-04\r\n' 

//or 
	
// cmd 'conf:volt:dc 100;:trig:sour bus;:trig:coun 1;:samp:coun 3\n' ,  'read?;*trg' or 'init;fetc?;*trg\n'
// cmd 'abort'

systick_time_t th963_timer;

typedef struct TH963_Meter {
	Uart_t *uart;
	volatile float measureVal;
	volatile unsigned char updated;
	volatile unsigned char started;
	char cmd[32];
	char cmdRes[32];
	volatile int cmdStep;
	volatile int initStep;
	char buffer[32];
	volatile int bufferIndex;
}TH963_Meter_t;


