RuanJG/stm32App/source/app/app_CSWL_Control_Board.c
TH963_Meter_t Vmeter_th963;


void TH963_cmd_reset(TH963_Meter_t * th963)
{
	th963->bufferIndex = 0;
	th963->cmd[0]=0;
	th963->cmdRes[0] =0;
	th963->cmdStep = 0;
}

void TH963_clear(TH963_Meter_t * th963)
{
	th963->started = 0;
	th963->updated = 0;
	th963->initStep = 0;
	TH963_cmd_reset( th963 );
	Uart_Clear_Rx( th963->uart );
}

int TH963_try_read_one_msg( TH963_Meter_t * th963 )
{
	volatile unsigned char data;
	
	while(1)
	{
		if( 1 == Uart_Get( th963->uart, &data ,1 ))
		{
			if( th963->bufferIndex >= (sizeof( th963->buffer ) -2) )
			{
				th963->bufferIndex = 0;
				PC_LOGE("TH963_try_read_one_msg: overflow!");
			}
			th963->buffer[ th963->bufferIndex++ ] = data;
			if( data == '\n' )
			{
				th963->buffer[ th963->bufferIndex++ ] = 0;
				th963->bufferIndex = 0;
				return 1;
			}
		}else{
			return 0;
		}
	}
}	

int TH963_cmd_even(TH963_Meter_t * th963, char * cmd , int timeoutMs , int waitResult)
{
	int cnt;
	volatile unsigned char data;
	
	switch( th963->cmdStep )
	{
		case -1:
			//error
			TH963_cmd_reset( th963 );
		break;
		
		case 0:  // send cmd
			TH963_cmd_reset( th963 );
			Uart_Put(th963->uart, (unsigned char*) cmd, strlen(cmd));
			th963->cmdStep++;
			systick_init_timer( &th963_timer, timeoutMs);
		break;
		
		case 1: // verify cmd 
			
			if( waitResult == 1 ){
				// if has result , no  wait for cmd error msg
				th963->cmdStep++;
				break;
			}
			
			if( 1 == TH963_try_read_one_msg( th963 ) )
			{
				PC_LOGE("TH963_cmd_even: error>%s",th963->buffer);
				th963->cmdStep = -1;
			}
			
			if( 1 == systick_check_timer( &th963_timer ) ){
				th963->cmdStep = 3;
			}
		
			#if 0  //echo verify cmd
			if( 1 == TH963_try_read_one_msg( th963 ) )
			{
				if( 0 == strcmp( th963->buffer , cmd ) )
				{
					//th963->bufferIndex = 0;
					th963->cmdStep++;
					systick_init_timer( &th963_timer, timeoutMs);
				}
			}
			if( 1 == systick_check_timer( &th963_timer ) ){
				PC_LOGE("TH963_cmd_even: verify cmd timeout !");
				th963->cmdStep = -1;
			}
			
			if( 1 == systick_check_timer( &th963_timer ) ){
				th963->cmdStep++;
			}
			#endif 

		break;
			
		case 2: //get result
			if( waitResult == 0 ){
				th963->cmdStep++;
				break;
			}
				
			if( 1 == TH963_try_read_one_msg( th963 ) )
			{
				strcpy( th963->cmdRes , th963->buffer);
				if( strncmp(th963->buffer, "Error 5", 7) == 0){
					PC_LOGE("TH963_cmd_even: Unknow cmd  !");
					th963->cmdStep = -1;
				}else{
					th963->cmdStep++;
				}
			}
			if( 1 == systick_check_timer( &th963_timer ) ){
				PC_LOGE("TH963_cmd_even: measure timeout !");
				th963->cmdStep = -1;
			}
				
		break;
			
		case 3:
			// finish
			TH963_cmd_reset( th963 );
		break;
		
		default:
			
		break;
	}
	
	if( th963->cmdStep == -1 ) return -1;
	if( th963->cmdStep == 3 ) return 1;
	
	return 0;
}


systick_time_t th963_delay_timer;
int TH963_cmd_sync(TH963_Meter_t * th963, char * cmd , int delayMs, int has_result , int retryTimes);

int TH963_init(TH963_Meter_t * th963, Uart_t *uart_p )
{
	th963->uart = uart_p;
	TH963_clear(th963);
	systick_init_timer( &th963_delay_timer, 200);
	return 0;
}

int TH963_start( TH963_Meter_t * th963 , int en )
{
	if( th963->started == 0 && en ==1 ){
		TH963_clear( th963 );
		//if( 1 != TH963_cmd_sync( th963, "conf:volt:dc 100;:trig:sour bus;:trig:coun 1;:samp:coun 1\n", 1000, 0, 1 ) ){
		//	PC_LOGE("TH963 init error\n");
		//};
	}
	th963->started = en;
	
	if( th963->started == 0 ){
		if( 1 != TH963_cmd_sync( th963, ":LOCal\n", 100, 0, 1 ) ){
			PC_LOGE("TH963 local error\n");
		};
		PC_LOGI("TH963 Vmeter stop\n");
	}
	if( th963->started == 1 ) {
		PC_LOGI("TH963 Vmeter start\n");
	}
	
	return 1;
}


void TH963_even(TH963_Meter_t * th963)
{
	int value;
	unsigned char data[4];
	
	if( th963->started != 1 ) return;
	
	// if( 0 == systick_check_timer( &th963_delay_timer ) ) return;

	// currently I just use measure cmd
	th963->initStep = 2; 
	
	switch( th963->initStep )
	{
		case 0:
			value = TH963_cmd_even( th963, "conf:volt:dc 100;:trig:sour bus;:trig:coun 1;:samp:coun 1\n", 300, 0);
		  if( value == 1 ){
				th963->initStep++;
			}
			if( value == -1 ){
				TH963_cmd_reset(th963);
			}
		break;
			
		case 1:
			value = TH963_cmd_even( th963, "init;read;trig\n", 300, 1);
		  if( value == 1 ){
				sscanf((const char*)th963->buffer , "%e\n\r",  &th963->measureVal);
				th963->updated = 1;
				memcpy( data, (unsigned char*) &th963->measureVal , 4 );
				if( 0 == PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_VMETER, data , sizeof(data) ) ){
					PC_LOGE("TH963_even: send data to PC error");
				}
				TH963_cmd_reset(th963);
			}
			if( value == -1 ){
				TH963_cmd_reset(th963);
			}
		break;
			
		case 2:
			//conf:volt:dc 100;:trig:sour bus;:trig:coun 1;:samp:coun 1;:*trg;:read?\n
		  //:MEASure:VOLTage:DC? 100\n
		value = TH963_cmd_even( th963, ":MEASure:VOLTage:DC? 100\n", 1500, 1 ); // can't be less than 800ms
		  if( value == 1 ){
				//PC_LOGI("th963>%s",th963->buffer);
				if( 1 == sscanf((const char*)th963->buffer , "%e\r\n",  &th963->measureVal) ){
					PC_LOGI("th963>%f",th963->measureVal);
					th963->updated = 1;
					memcpy( data, (unsigned char*) &th963->measureVal , 4 );
					if( 0 == PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_VMETER, data , sizeof(data) ) ){
						PC_LOGE("TH963_even: send data to PC error");
					}
				}else{
					PC_LOGE("TH963_even:data error>%s",th963->buffer);
				}
				TH963_cmd_reset(th963);
			}
			if( value == -1 ){
				TH963_cmd_reset(th963);
			}
		break;
			
		default:
			
		break;
	}
	
}


int TH963_cmd_sync(TH963_Meter_t * th963, char * cmd , int delayMs, int has_result , int retryTimes)
{
	volatile int val;
	int i;
	
	
	for( i=0; i< retryTimes; i++)
	{
		TH963_cmd_reset(th963);
		while( 1 ){
			val = TH963_cmd_even( th963, cmd , delayMs, has_result ) ;
			if( val  != 0 ) break;
		}
		if( val == 1 ){
			break;
		}
	}
	
	if( val == 1 ) return 1;
	return 0;
}

float TH963_measure( TH963_Meter_t * th963 )
{
	if( 1 == TH963_cmd_sync(th963, "MEAS:VOLT:DC? 100\n" , 500, 1 , 3) ){
		sscanf((const char*)th963->buffer , "%e\r\n",  &th963->measureVal);
		return th963->measureVal;
	}else{
		return 0;
	}
}

#endif















