RuanJG/stm32App/source/app/app_CSWL_Control_Board.c
void cmd_even()
{
	unsigned char buffer[8];
	unsigned char i, len;
	
	len = Uart_Get(CONSOLE_UART,buffer,1);// USB_RxRead( buffer, 8 );
	
	if( len == 0 ) return;

	if( buffer[0] == 'd' ){
		debug_en = debug_en ? 0:1;
	}else if( buffer[0] == '1' ){
		uart_pressure_dev = &Uart1;
		uart_pressure_test_en = 1;
		uart_pressure_round = 0;
		_LOGW("Uart Test Uart1\n");
	}else if( buffer[0] == '2' ){
		uart_pressure_dev = &Uart2;
		uart_pressure_test_en = 1;
		uart_pressure_round = 0;
		_LOGW("Uart Test Uart2\n");
	}else if( buffer[0] == '3' ){
		uart_pressure_dev = &Uart3;
		uart_pressure_test_en = 1;
		uart_pressure_round = 0;
		_LOGW("Uart Test Uart3\n");
	}else if( buffer[0] == '4' ){
		uart_pressure_dev =  &Uart4;
		uart_pressure_test_en = 1;
		uart_pressure_round = 0;
		_LOGW("Uart Test Uart4\n");
	}else if( buffer[0] == '0' ){
		uart_pressure_dev = NULL;
		uart_pressure_test_en = 0;
		_LOGW("Uart Test STOP\n");
	}
}


volatile int relayTestIndex = 0;
volatile int relayTestCounter = 0;
void relay_test_even()
{
	static int on_off = 0;
	
	if( relayTestIndex == 0 ) return;
	
	systick_delay_ms(500);
	if( on_off ){
		relay_update_status(relayTestIndex);
		on_off = 0;
		relayTestCounter++;
	}else{
		relay_update_status(0);
		on_off = 1;
	}
}


void PC_msg_handler(PMSG_msg_t msg)
{
	int value,res;
	
	switch( msg.tag )
	{
		case PC_TAG_CMD_SWITCH:
			if( msg.data_len == 1 ){
				relay_update_status( msg.data[0] );
				PC_LOGI("PC_TAG_CMD_SWITCH: status = %02x", relay_status);
			}else{
				PC_LOGE("PC_TAG_CMD_SWITCH: unknow data");
			}
		break;
			
		case PC_TAG_CMD_UART_TEST:
			if( msg.data_len != 1 ){
				if( msg.data[0] == 0 ){
					uart_pressure_dev = NULL;
					uart_pressure_test_en = 0;
					_LOGW("Uart Test STOP\n");
				}else if( msg.data[0] >= 1 && msg.data[0] <= 5){
					uart_pressure_test_en = 1;
					uart_pressure_round = 0;
					uart_pressure_dev = UartList[msg.data[0]-1];
					PC_LOGE("PC_TAG_CMD_UART_TEST: Uart%d start test\n",msg.data[0]-1);
				}else{
					PC_LOGE("PC_TAG_CMD_UART_TEST: data out of range");
				}
			}else{
				PC_LOGE("PC_TAG_CMD_UART_TEST: unknow data");
			}
		break;
			
		case PC_TAG_CMD_CAPTURE_EN:
		case PC_TAG_CMD_LED_SELECT:
		case PC_TAG_CMD_CAPTURE_INTERVAL:
		case PC_TAG_CMD_TEST:
		case PC_TAG_CMD_SWITCHES_TESTMODE:
		case PC_TAG_CMD_SWITCHES_CHANNEL:
			
			if( 0 == PMSG_send_msg_no_Tag( &LED_pmsg , msg.alldata, msg.alldata_len) ){
				PC_LOGE("PC_msg_handler: Forward bytes to LED Failed");
			}
		break;
			
		case PMSG_TAG_IAP_START_ID:
			if( msg.data_len == 1 ){
				iap_jump();
			}else{
				PC_LOGE("PMSG_TAG_IAP_START_ID: data error");
			}
		break;
			
		case PC_TAG_CMD_AMETER_READ:
			if( msg.data_len == 1 ){
				if( 0 == Ameter_start( msg.data[0] ) ){
					PC_LOGE("PC_TAG_CMD_AMETER_READ: start meter failed");
				}
			}else{
				PC_LOGE("PC_TAG_CMD_AMETER_READ: data error");
			}
		break;
			
		case PC_TAG_CMD_VMETER_READ:
			if( msg.data_len == 1 ){
				if( (msg.data[0] & 0xf0) != 0 ){
					vmeter_type = ( msg.data[0] & 0x0f );
				}
				#if USING_VICTOR8165_AS_VMETER
				if( vmeter_type == VMETER_TYPE_8165 )
				{
					if( (msg.data[0] & 0xf0) == 0 ){
						victor8165_stop();
					}else{
						victor8165_start();
					}	
				}
				#endif
				#if USING_TONGHUI_TH963_VMETER
				if( vmeter_type == VMETER_TYPE_TH963 )
				{
					if( 0 == TH963_start( &Vmeter_th963,(msg.data[0]>>4) ) ){
						PC_LOGE("PC_TAG_CMD_VMETER_READ: start meter failed");
					}
				}
				#endif
			}else{
				PC_LOGE("PC_TAG_CMD_VMETER_READ: data error");
			}
		break;
			
		case PC_TAG_FORWARD_LEDBOARD:
			if( msg.data_len >= 1 ){
				if( 0 == PMSG_send_msg_no_Tag( &LED_pmsg , msg.data, msg.data_len) ){
					PC_LOGE("PC_TAG_FORWARD_LEDBOARD: send Failed");
				}
			}else{
				PC_LOGE("PC_TAG_FORWARD_LEDBOARD: data error");
			}
		break;
			
		case 0xff:
			PC_LOGI("Last Relay Test: 0x%02x, On-Off count:%d",relayTestIndex, relayTestCounter);
			relayTestIndex = msg.data[0];
			relayTestCounter = 0;
			PC_LOGI("Start Relay Test: 0x%02x",relayTestIndex);
		break;
			
		default:
			if( (msg.tag & 0xf0) != PMSG_TAG_FORWARD )
			{
				PC_LOGE("PC_PMSG:  unknow data(0x%02x)",msg.tag);
				break;
			}
			
			if( (msg.tag&0x0f) == 0x2 ){
				Uart_Put(&Uart2, msg.data,msg.data_len);
			}else if( (msg.tag&0xf) == 0x3 ){
				Uart_Put(&Uart3, msg.data,msg.data_len);
			}else if( (msg.tag&0xf) == 0x4 ){
				Uart_Put(&Uart4, msg.data,msg.data_len);
			}else if( (msg.tag&0xf) == 0x5 ){
				Uart_Put(&Uart5, msg.data,msg.data_len);
			}else{
				PC_LOGE("PMSG_FORWARD:  unknow way (0x%02x)",msg.tag);
			}
			break;
	}
	
}


//just forward to PC 
void LED_msg_handler(PMSG_msg_t msg)
{
	if( 0 == PMSG_send_msg_no_Tag( &PC_pmsg , msg.alldata, msg.alldata_len) ){
		PC_LOGE("LED_msg_handler: Forward to PC error");
	}
}








#if BOARD_IAP 
void app_init()
{
	relay_init();
	Uart_USB_SWJ_init();
#if IAP_APP_PORT_UART
	iap_app_init(PC_UART,PORT_UART_TYPE );
#endif
}
void app_event()
{
	iap_app_event();
}
#else



void app_init()
{
	relay_init();
	Uart_USB_SWJ_init();
	PMSG_init_uart( &PC_pmsg, PC_UART, PC_msg_handler );
	PMSG_init_uart( &LED_pmsg, LED_UART, LED_msg_handler );
	//PMSG_init_uart_irq( &LED_pmsg, LED_UART, LED_msg_handler );
	switch_init();
	Ameter_init();
	
#if USING_VICTOR8165_AS_VMETER
	victor8165_init( VMETER_UART );
#endif
#if USING_TONGHUI_TH963_VMETER
	TH963_init( &Vmeter_th963 , VMETER_UART );
#endif
	

	if( SystemCoreClock != 72000000 ){
		_LOGE("CLK init error");
		systick_delay_ms(1000);
		while(1);
	}
	
#if BOARD_HAS_IAP
	#if IAP_PORT_USB 
	iap_init_in_usb();
	#endif
	#if IAP_PORT_CAN1
	iap_init_in_can1();
	#endif
	#if  IAP_PORT_UART
	iap_init_in_uart( IAP_UART );
	#endif
#endif
	
	PC_LOGI("Init OK");
}


void app_event()
{

	switch_even();
	
#if USING_CMD_EVEN
	cmd_even();
#endif
	
	//relay_test_even();
	
	if( uart_pressure_test_en == 1 )
	{ 
		uart_pressure_test_loop();
	}else{
		PMSG_even( &PC_pmsg );
		PMSG_even( &LED_pmsg );
	}
	
	if( vmeter_type == VMETER_TYPE_8165 ){
#if USING_VICTOR8165_AS_VMETER
		victor8165_even();
#endif
	}else if( vmeter_type == VMETER_TYPE_TH963 ){
#if USING_TONGHUI_TH963_VMETER
		TH963_even(&Vmeter_th963);
#endif
	}else{
		
	}
	
}


#endif // BORAD_IAP






#endif //BOARD_CSWL_LED_MONITOR
